БылковДА_70180166/src/Documents/ВедомостьОСистемеАкадемическихЗадолженностейДляСтудентовсИОМ/ВедомостьОСистемеАкадемическихЗадолженностейДляСтудентовсИОМ.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВедомостьОСистемеАкадемическихЗадолженностейДляСтудентовсИОМ</name>
  <basedOn>Document.ИндивидуальныйПланЛиквидацииЗадолженностей</basedOn>
  <registerRecords>InformationRegister.ОценкиСтудентов</registerRecords>
  <attributes>
    <name>Преподаватель</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <tabularSections>
    <name>РезультатЗаседанияКомиссии</name>
    <attributes>
      <name>Группа</name>
      <type>
        <types>CatalogRef.Группы</types>
      </type>
    </attributes>
    <attributes>
      <name>Студент</name>
      <type>
        <types>CatalogRef.Студенты</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидКонтроля</name>
      <type>
        <types>EnumRef.НаименованиеКонтроля</types>
      </type>
    </attributes>
    <attributes>
      <name>Дисциплина</name>
      <type>
        <types>CatalogRef.Дисциплины</types>
      </type>
    </attributes>
    <attributes>
      <name>Оценка</name>
      <type>
        <types>EnumRef.Оценка</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусАкадемическойЗадолженности</name>
      <type>
        <types>EnumRef.НаименованиеСтатуса</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

БылковДА_70180166/src/Documents/ВедомостьОСистемеАкадемическихЗадолженностейДляСтудентовсИОМ/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОценкиСтудентов
	Движения.ОценкиСтудентов.Записывать = Истина;
	Для Каждого ТекСтрокаРезультатЗаседанияКомиссии Из РезультатЗаседанияКомиссии Цикл
		Движение = Движения.ОценкиСтудентов.Добавить();
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаРезультатЗаседанияКомиссии.Студент;
		Движение.Группа = ТекСтрокаРезультатЗаседанияКомиссии.Группа;
		Движение.Дисциплина = ТекСтрокаРезультатЗаседанияКомиссии.Дисциплина;
		Движение.ВидКонтроля = ТекСтрокаРезультатЗаседанияКомиссии.ВидКонтроля;
		Движение.Преподаватель = Преподаватель;
		Движение.Оценка = ТекСтрокаРезультатЗаседанияКомиссии.Оценка;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, СтандартнаяОбработка)
	//{{__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ИндивидуальныйПланЛиквидацииЗадолженностей") Тогда
		// Заполнение шапки
		Преподаватель = ДанныеЗаполнения.Преподаватель;
	КонецЕсли;
	//}}__КОНСТРУКТОР_ВВОД_НА_ОСНОВАНИИ
КонецПроцедуры
